#+STARTUP: fold
#+PROPERTY: header-args:ipython :results both :exports both :async yes :session overlap :kernel dual_data

* Notebook Settings

#+begin_src ipython
%load_ext autoreload
%autoreload 2
%reload_ext autoreload

%run /home/leon/dual_task/dual_data/notebooks/setup.py
%matplotlib inline
%config InlineBackend.figure_format = 'png'
#+end_src

#+RESULTS:
: The autoreload extension is already loaded. To reload it, use:
:   %reload_ext autoreload
: Python exe
: /home/leon/mambaforge/envs/dual_data/bin/python

** Fit

#+begin_src ipython
  net = RegularizedNet(
      module=Perceptron,
      module__num_features=693,
      module__dropout_rate=0.0,
      alpha=0.01,
      l1_ratio=options['l1_ratio'],
      criterion=CustomBCEWithLogitsLoss,
      optimizer=optim.Adam,
      optimizer__lr=0.1,
      max_epochs=1000,
      callbacks=[early_stopping],
      train_split=None,
      iterator_train__shuffle=False,  # Ensure the data is shuffled each epoch
      verbose=0,
      device= DEVICE if torch.cuda.is_available() else 'cpu',  # Assuming you might want to use CUDA
  )

  pipe = []
  # pipe.append(("scaler", StandardScaler()))
  pipe.append(("net", net))
  pipe = Pipeline(pipe)
#+end_src

#+RESULTS:

#+begin_src ipython
  params = {
    'net__alpha': np.logspace(-4, 4, 20),
    # 'net__l1_ratio': np.linspace(0, 1, 10),
    # 'net__module__dropout_rate': np.linspace(0, 1, 10),
  }

  options['reload'] = 0
  options['task'] = 'Dual'
  scoring = 'accuracy'

  # days = ['first', 'last']

  for mouse in mice:
    options['mouse'] = mouse
    options = set_options(**options)
    days = np.arange(1, options['n_days']+1)

    index = mice.index(mouse)

    pipe['net'].module__num_features = N_NEURONS[index]

    overlaps_sample = []
    coefs_sample = []
    bias_sample = []

    overlaps_dist = []
    coefs_dist = []
    bias_dist = []

    overlaps_choice = []
    coefs_choice = []
    bias_choice = []

    for day in days:
        options['day'] = day

        options['task'] = 'all'
        options['features'] = 'sample'
        overlaps, scores, coefs, bias = hyper_tune(pipe, epoch='MD', params=params, scoring=scoring, **options)

        overlaps_sample.append(overlaps)
        coefs_sample.append(coefs)
        bias_sample.append(bias)

        options['task'] = 'Dual'
        options['features'] = 'distractor'
        overlaps, scores, coefs, bias = hyper_tune(pipe, epoch='MD', params=params, scoring=scoring, **options)

        overlaps_dist.append(overlaps)
        coefs_dist.append(coefs)
        bias_dist.append(bias)

        options['task'] = 'all'
        options['features'] = 'choice'
        overlaps, scores, coefs, bias = hyper_tune(pipe, epoch='CHOICE', params=params, scoring=scoring, **options)

        overlaps_choice.append(overlaps)
        coefs_choice.append(coefs)
        bias_choice.append(bias)

    overlaps_sample = np.array(overlaps_sample)
    overlaps_dist = np.array(overlaps_dist)
    overlaps_choice = np.array(overlaps_choice)

    overlaps_dist = np.pad(overlaps_dist, pad_width=[(0, 0), (0, overlaps_sample.shape[1] - overlaps_dist.shape[1]), (0, 0)], mode='constant', constant_values=np.nan)

    overlaps_save = np.stack((overlaps_sample, overlaps_dist, overlaps_choice))
    print('overlaps', overlaps_save.shape)
    pkl_save(overlaps_save, '%s_overlaps_%.2f_l1_ratio%s' % (options['mouse'], options['l1_ratio'], options['fname']), path="../data/%s/" % options['mouse'])

    coefs_save = np.stack((coefs_sample, coefs_dist, coefs_choice))
    print('coefs', coefs_save.shape)
    pkl_save(coefs_save, '%s_coefs_%.2f_l1_ratio%s' % (options['mouse'], options['l1_ratio'], options['fname']), path="../data/%s/" % options['mouse'])
    #+end_src

#+RESULTS:
#+begin_example
  Loading files from /home/leon/dual_task/dual_data/data/ChRM04
  DATA: FEATURES sample TASK all TRIALS  DAYS 1 LASER 0
  X (96, 668, 84) y (96,)
  hyperparam fitting ...
  Elapsed (with compilation) = 0h 0m 14s
  {'net__alpha': 0.004832930238571752}
  Loading files from /home/leon/dual_task/dual_data/data/ChRM04
  DATA: FEATURES distractor TASK Dual TRIALS  DAYS 1 LASER 0
  X (64, 668, 84) y (64,)
  hyperparam fitting ...
  Elapsed (with compilation) = 0h 0m 2s
  {'net__alpha': 0.012742749857031334}
  Loading files from /home/leon/dual_task/dual_data/data/ChRM04
  DATA: FEATURES choice TASK all TRIALS  DAYS 1 LASER 0
  X (96, 668, 84) y (96,)
  hyperparam fitting ...
  Elapsed (with compilation) = 0h 0m 2s
  {'net__alpha': 0.012742749857031334}
  Loading files from /home/leon/dual_task/dual_data/data/ChRM04
  DATA: FEATURES sample TASK all TRIALS  DAYS 2 LASER 0
  X (96, 668, 84) y (96,)
  hyperparam fitting ...
  Elapsed (with compilation) = 0h 0m 3s
  {'net__alpha': 0.004832930238571752}
  Loading files from /home/leon/dual_task/dual_data/data/ChRM04
  DATA: FEATURES distractor TASK Dual TRIALS  DAYS 2 LASER 0
  X (64, 668, 84) y (64,)
  hyperparam fitting ...
  Elapsed (with compilation) = 0h 0m 3s
  {'net__alpha': 0.012742749857031334}
  Loading files from /home/leon/dual_task/dual_data/data/ChRM04
  DATA: FEATURES choice TASK all TRIALS  DAYS 2 LASER 0
  X (96, 668, 84) y (96,)
  hyperparam fitting ...
  Elapsed (with compilation) = 0h 0m 2s
  {'net__alpha': 0.012742749857031334}
  Loading files from /home/leon/dual_task/dual_data/data/ChRM04
  DATA: FEATURES sample TASK all TRIALS  DAYS 3 LASER 0
  X (96, 668, 84) y (96,)
  hyperparam fitting ...
  Elapsed (with compilation) = 0h 0m 3s
  {'net__alpha': 0.004832930238571752}
  Loading files from /home/leon/dual_task/dual_data/data/ChRM04
  DATA: FEATURES distractor TASK Dual TRIALS  DAYS 3 LASER 0
  X (64, 668, 84) y (64,)
  hyperparam fitting ...
  Elapsed (with compilation) = 0h 0m 2s
  {'net__alpha': 0.012742749857031334}
  Loading files from /home/leon/dual_task/dual_data/data/ChRM04
  DATA: FEATURES choice TASK all TRIALS  DAYS 3 LASER 0
  X (96, 668, 84) y (96,)
  hyperparam fitting ...
#+end_example

